import pandas as pd

data = {'이름' : ['KIm', 'Park', 'Lee', 'Ho'],
        '국어' : [90, 58, 88, 100],
        '영어' : [100, 60, 80, 70],
        '수학' : [55, 65, 76, 88] }
df = pd.DataFrame(data)

print("1>--------------------------------------------------------------")
print("국어 평균 : ", df['국어'].mean(), end='\n\n')    # df[열 범위].mean = 평균값(점수들 평균)
print("국어 중간 : ", df['국어'].median(), end='\n\n')  # df[열 범위].median = 중간값(점수들의 중간 값 / 점수들의 개수가 짝수일때는 두 점수를 더해서 2로 나눔)
print("국어 최소 : ", df['국어'].min(), end='\n\n')     # df[열 범위].min = 최소값(점수 중 최소값)
print("국어 최대 : ", df['국어'].max(), end='\n\n')     # df[열 범위].max = 최대값(점수 중 최대값)

print("2>--------------------------------------------------------------")
print("Kim 총점 : ", df.iloc[0, 1:4].sum(), end='\n\n') #df.iloc[0, 1:4].sum() = 0행 1~3열 점수들 총합
print("Kim 평균 : ", df.iloc[0, 1:4].mean(), end='\n\n') #df.iloc[0, 1:4].mean() = 0행 1~3열 점수들 평균

print("3>--------------------------------------------------------------")
print("수학 4분위 \n ", df['수학'].quantile([0.25,0.5,0.75]), end='\n\n') # 데이터를 네 구간으로 나눔
print("수학 분산  : ", df['수학'].var(), end='\n\n')
print("수학 표준편차 : ", df['수학'].std(), end='\n\n')